// タイマーモジュール(上田先生のプログラムから引用)

#define CONIOEX
#include "conioex.h"
#include "TIMER.h"

//---------------------------------------------------------
// グローバル変数宣言
//---------------------------------------------------------
static DWORD	now_time, pre_time;	// 時間計測用
static DWORD	remaining_time;		// 残り時間チェック用

//---------------------------------------------------------
// タイマー初期処理
//---------------------------------------------------------
void TimerInit(void)
{
	timeBeginPeriod(1);	// タイマー分解能を高精度(1m秒ごと)に設定
}
//---------------------------------------------------------
// タイマー終了処理
//---------------------------------------------------------
void TimerEnd(void)
{
	;
}
//---------------------------------------------------------
// 残り時間計測用タイマーに指定した時間をセットする
//---------------------------------------------------------
void setTimerRemaining(DWORD timer_value)
{
	now_time = pre_time = timeGetTime();	// 現タイマー値を初期記録
	remaining_time = timer_value;			// 残り時間を初期記録
}
//---------------------------------------------------------
// 残り時間を更新して残り時間を返す
//---------------------------------------------------------
DWORD getTimerRemaining(void)
{
	now_time = timeGetTime();				// 現タイマー値を求める
	if (remaining_time > (now_time - pre_time)) {
		remaining_time -= (now_time - pre_time);// 以前記録した時からの経過時間を残り時間から引く
	}
	else {
		remaining_time = 0;
	}
	pre_time = now_time;					// 残り時間を記録したタイマー値を記録

	return remaining_time;	// 残り時間を返す
}
