// タイトル画面用ヘッダ

#ifndef _TITLE_H_	// ２重インクルード防止のマクロ定義
#define _TITLE_H_

#include "title.h"
#include "conioex.h"

//-------------------------------------------------------------------
// マクロ定義
//-------------------------------------------------------------------
#define AA_MENU_POS_X -31
#define AA_MENU_POS_Y 17

//---------------------------------------------------------
// 構造体
//---------------------------------------------------------

//---------------------------------------------------------
// 関数プロトタイプ宣言
//---------------------------------------------------------
void title_Init(void);
void title_End(void);
void title_Update(void);
void title_Draw(void);
void AA_title_Draw(void);
void AA_menu_Draw(void);

#endif
